{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 20,
      "content": "?",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 21,
      "content": "[",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 22,
      "content": "]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": ""
    },
    "behavior": "Removed",
    "invert": false
  },
  "post_processor": {
    "type": "BertProcessing",
    "sep": [
      "]",
      22
    ],
    "cls": [
      "[",
      21
    ]
  },
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "WordLevel",
    "vocab": {
      "A": 0,
      "C": 1,
      "D": 2,
      "E": 3,
      "F": 4,
      "G": 5,
      "H": 6,
      "I": 7,
      "K": 8,
      "L": 9,
      "M": 10,
      "N": 11,
      "P": 12,
      "Q": 13,
      "R": 14,
      "S": 15,
      "T": 16,
      "V": 17,
      "W": 18,
      "Y": 19,
      "?": 20,
      "[": 21,
      "]": 22,
      "-": 23
    },
    "unk_token": "?"
  }
}